; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image4 - mode
	infrared3 - mode
	thermograph1 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation8 - direction
	Star9 - direction
	Star11 - direction
	GroundStation15 - direction
	GroundStation19 - direction
	GroundStation29 - direction
	GroundStation37 - direction
	Star35 - direction
	GroundStation33 - direction
	Star36 - direction
	Star24 - direction
	GroundStation13 - direction
	GroundStation3 - direction
	Star2 - direction
	Star31 - direction
	Star20 - direction
	GroundStation32 - direction
	Star5 - direction
	GroundStation25 - direction
	Star26 - direction
	GroundStation17 - direction
	GroundStation22 - direction
	GroundStation14 - direction
	Star0 - direction
	Star18 - direction
	Star7 - direction
	GroundStation27 - direction
	Star28 - direction
	GroundStation1 - direction
	Star23 - direction
	Star12 - direction
	GroundStation38 - direction
	GroundStation10 - direction
	Star30 - direction
	Star21 - direction
	Star4 - direction
	Star34 - direction
	GroundStation39 - direction
	GroundStation6 - direction
	Star16 - direction
	Planet40 - direction
	Phenomenon41 - direction
	Planet42 - direction
	Planet43 - direction
	Star44 - direction
	Star45 - direction
	Planet46 - direction
	Star47 - direction
	Phenomenon48 - direction
	Phenomenon49 - direction
	Planet50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Planet53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Planet56 - direction
	Star57 - direction
	Phenomenon58 - direction
	Star59 - direction
	Phenomenon60 - direction
	Phenomenon61 - direction
	Phenomenon62 - direction
	Planet63 - direction
	Planet64 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star34)
	(calibration_target instrument0 GroundStation32)
	(calibration_target instrument0 GroundStation25)
	(calibration_target instrument0 GroundStation33)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star31)
	(calibration_target instrument1 Star23)
	(calibration_target instrument1 Star36)
	(calibration_target instrument1 GroundStation32)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation33)
	(calibration_target instrument1 GroundStation17)
	(calibration_target instrument1 Star16)
	(calibration_target instrument1 Star24)
	(calibration_target instrument1 Star35)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation25)
	(calibration_target instrument2 GroundStation14)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation27)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star20)
	(calibration_target instrument3 Star28)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star31)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star24)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star26)
	(calibration_target instrument3 Star21)
	(calibration_target instrument3 Star12)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon52)
	(supports instrument4 infrared2)
	(supports instrument4 image4)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star30)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation32)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star20)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star34)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation25)
	(calibration_target instrument5 GroundStation22)
	(supports instrument6 infrared3)
	(supports instrument6 image4)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 GroundStation38)
	(calibration_target instrument6 Star12)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star28)
	(calibration_target instrument6 GroundStation17)
	(calibration_target instrument6 Star26)
	(calibration_target instrument6 GroundStation10)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 infrared2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star0)
	(supports instrument8 image4)
	(supports instrument8 infrared2)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star21)
	(calibration_target instrument8 GroundStation22)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 Star7)
	(supports instrument9 infrared2)
	(supports instrument9 image4)
	(calibration_target instrument9 Star12)
	(calibration_target instrument9 GroundStation27)
	(calibration_target instrument9 Star7)
	(calibration_target instrument9 Star18)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 GroundStation14)
	(supports instrument10 infrared3)
	(supports instrument10 infrared2)
	(calibration_target instrument10 Star16)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 GroundStation39)
	(calibration_target instrument10 Star34)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 Star21)
	(calibration_target instrument10 Star30)
	(calibration_target instrument10 GroundStation10)
	(calibration_target instrument10 GroundStation38)
	(calibration_target instrument10 Star12)
	(calibration_target instrument10 Star23)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 Star28)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star24)
)
(:goal (and
	(have_image Planet40 image4)
	(have_image Phenomenon41 infrared2)
	(have_image Planet42 image4)
	(have_image Planet43 image4)
	(have_image Star44 infrared2)
	(have_image Star45 thermograph1)
	(have_image Planet46 image4)
	(have_image Star47 spectrograph0)
	(have_image Phenomenon48 spectrograph0)
	(have_image Phenomenon49 image4)
	(have_image Planet50 infrared2)
	(have_image Planet51 spectrograph0)
	(have_image Phenomenon52 infrared2)
	(have_image Planet53 infrared2)
	(have_image Phenomenon54 image4)
	(have_image Planet55 infrared2)
	(have_image Planet56 infrared2)
	(have_image Star57 thermograph1)
	(have_image Phenomenon58 infrared2)
	(have_image Star59 image4)
	(have_image Phenomenon60 infrared2)
	(have_image Phenomenon61 infrared2)
	(have_image Phenomenon62 infrared2)
	(have_image Planet63 infrared3)
	(have_image Planet64 infrared2)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 25
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 25
3. (calibrate satellite0 instrument1 groundstation27)
   added: (calibrated instrument1)
   goals met: 0 of 25
4. (turn_to satellite2 phenomenon41 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon41)
   goals met: 0 of 25
5. (turn_to satellite0 phenomenon48 groundstation27)
   deleted: (pointing satellite0 groundstation27)
   added: (pointing satellite0 phenomenon48)
   goals met: 0 of 25
6. (take_image satellite0 phenomenon48 instrument1 spectrograph0)
   added: (have_image phenomenon48 spectrograph0)
   goals met: 1 of 25
7. (turn_to satellite0 planet51 phenomenon48)
   deleted: (pointing satellite0 phenomenon48)
   added: (pointing satellite0 planet51)
   goals met: 1 of 25
8. (take_image satellite0 planet51 instrument1 spectrograph0)
   added: (have_image planet51 spectrograph0)
   goals met: 2 of 25
9. (turn_to satellite0 planet63 planet51)
   deleted: (pointing satellite0 planet51)
   added: (pointing satellite0 planet63)
   goals met: 2 of 25
10. (take_image satellite0 planet63 instrument1 infrared3)
   added: (have_image planet63 infrared3)
   goals met: 3 of 25
11. (turn_to satellite0 star45 planet63)
   deleted: (pointing satellite0 planet63)
   added: (pointing satellite0 star45)
   goals met: 3 of 25
12. (take_image satellite0 star45 instrument1 thermograph1)
   added: (have_image star45 thermograph1)
   goals met: 4 of 25
13. (turn_to satellite0 star47 star45)
   deleted: (pointing satellite0 star45)
   added: (pointing satellite0 star47)
   goals met: 4 of 25
14. (take_image satellite0 star47 instrument1 spectrograph0)
   added: (have_image star47 spectrograph0)
   goals met: 5 of 25
15. (turn_to satellite0 star57 star47)
   deleted: (pointing satellite0 star47)
   added: (pointing satellite0 star57)
   goals met: 5 of 25
16. (take_image satellite0 star57 instrument1 thermograph1)
   added: (have_image star57 thermograph1)
   goals met: 6 of 25
17. (turn_to satellite2 star5 phenomenon41)
   deleted: (pointing satellite2 phenomenon41)
   added: (pointing satellite2 star5)
   goals met: 6 of 25
18. (calibrate satellite2 instrument4 star5)
   added: (calibrated instrument4)
   goals met: 6 of 25
19. (turn_to satellite2 phenomenon41 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon41)
   goals met: 6 of 25
20. (take_image satellite2 phenomenon41 instrument4 infrared2)
   added: (have_image phenomenon41 infrared2)
   goals met: 7 of 25
21. (turn_to satellite2 phenomenon49 phenomenon41)
   deleted: (pointing satellite2 phenomenon41)
   added: (pointing satellite2 phenomenon49)
   goals met: 7 of 25
22. (take_image satellite2 phenomenon49 instrument4 image4)
   added: (have_image phenomenon49 image4)
   goals met: 8 of 25
23. (turn_to satellite2 phenomenon52 phenomenon49)
   deleted: (pointing satellite2 phenomenon49)
   added: (pointing satellite2 phenomenon52)
   goals met: 8 of 25
24. (take_image satellite2 phenomenon52 instrument4 infrared2)
   added: (have_image phenomenon52 infrared2)
   goals met: 9 of 25
25. (turn_to satellite2 phenomenon54 phenomenon52)
   deleted: (pointing satellite2 phenomenon52)
   added: (pointing satellite2 phenomenon54)
   goals met: 9 of 25
26. (take_image satellite2 phenomenon54 instrument4 image4)
   added: (have_image phenomenon54 image4)
   goals met: 10 of 25
27. (turn_to satellite2 phenomenon58 phenomenon54)
   deleted: (pointing satellite2 phenomenon54)
   added: (pointing satellite2 phenomenon58)
   goals met: 10 of 25
28. (take_image satellite2 phenomenon58 instrument4 infrared2)
   added: (have_image phenomenon58 infrared2)
   goals met: 11 of 25
29. (turn_to satellite2 phenomenon60 phenomenon58)
   deleted: (pointing satellite2 phenomenon58)
   added: (pointing satellite2 phenomenon60)
   goals met: 11 of 25
30. (take_image satellite2 phenomenon60 instrument4 infrared2)
   added: (have_image phenomenon60 infrared2)
   goals met: 12 of 25
31. (turn_to satellite2 phenomenon61 phenomenon60)
   deleted: (pointing satellite2 phenomenon60)
   added: (pointing satellite2 phenomenon61)
   goals met: 12 of 25
32. (take_image satellite2 phenomenon61 instrument4 infrared2)
   added: (have_image phenomenon61 infrared2)
   goals met: 13 of 25
33. (turn_to satellite2 phenomenon62 phenomenon61)
   deleted: (pointing satellite2 phenomenon61)
   added: (pointing satellite2 phenomenon62)
   goals met: 13 of 25
34. (take_image satellite2 phenomenon62 instrument4 infrared2)
   added: (have_image phenomenon62 infrared2)
   goals met: 14 of 25
35. (turn_to satellite2 planet40 phenomenon62)
   deleted: (pointing satellite2 phenomenon62)
   added: (pointing satellite2 planet40)
   goals met: 14 of 25
36. (take_image satellite2 planet40 instrument4 image4)
   added: (have_image planet40 image4)
   goals met: 15 of 25
37. (turn_to satellite2 planet42 planet40)
   deleted: (pointing satellite2 planet40)
   added: (pointing satellite2 planet42)
   goals met: 15 of 25
38. (take_image satellite2 planet42 instrument4 image4)
   added: (have_image planet42 image4)
   goals met: 16 of 25
39. (turn_to satellite2 planet43 planet42)
   deleted: (pointing satellite2 planet42)
   added: (pointing satellite2 planet43)
   goals met: 16 of 25
40. (take_image satellite2 planet43 instrument4 image4)
   added: (have_image planet43 image4)
   goals met: 17 of 25
41. (turn_to satellite2 planet46 planet43)
   deleted: (pointing satellite2 planet43)
   added: (pointing satellite2 planet46)
   goals met: 17 of 25
42. (take_image satellite2 planet46 instrument4 image4)
   added: (have_image planet46 image4)
   goals met: 18 of 25
43. (turn_to satellite2 planet50 planet46)
   deleted: (pointing satellite2 planet46)
   added: (pointing satellite2 planet50)
   goals met: 18 of 25
44. (take_image satellite2 planet50 instrument4 infrared2)
   added: (have_image planet50 infrared2)
   goals met: 19 of 25
45. (turn_to satellite2 planet53 planet50)
   deleted: (pointing satellite2 planet50)
   added: (pointing satellite2 planet53)
   goals met: 19 of 25
46. (take_image satellite2 planet53 instrument4 infrared2)
   added: (have_image planet53 infrared2)
   goals met: 20 of 25
47. (turn_to satellite2 planet55 planet53)
   deleted: (pointing satellite2 planet53)
   added: (pointing satellite2 planet55)
   goals met: 20 of 25
48. (take_image satellite2 planet55 instrument4 infrared2)
   added: (have_image planet55 infrared2)
   goals met: 21 of 25
49. (turn_to satellite2 planet56 planet55)
   deleted: (pointing satellite2 planet55)
   added: (pointing satellite2 planet56)
   goals met: 21 of 25
50. (take_image satellite2 planet56 instrument4 infrared2)
   added: (have_image planet56 infrared2)
   goals met: 22 of 25
51. (turn_to satellite2 planet64 planet56)
   deleted: (pointing satellite2 planet56)
   added: (pointing satellite2 planet64)
   goals met: 22 of 25
52. (take_image satellite2 planet64 instrument4 infrared2)
   added: (have_image planet64 infrared2)
   goals met: 23 of 25
53. (turn_to satellite2 star44 planet64)
   deleted: (pointing satellite2 planet64)
   added: (pointing satellite2 star44)
   goals met: 23 of 25
54. (take_image satellite2 star44 instrument4 infrared2)
   added: (have_image star44 infrared2)
   goals met: 24 of 25
55. (turn_to satellite2 star59 star44)
   deleted: (pointing satellite2 star44)
   added: (pointing satellite2 star59)
   goals met: 24 of 25
56. (take_image satellite2 star59 instrument4 image4)
   added: (have_image star59 image4)
   goals met: 25 of 25
